{
  "sections": {
    "home": {
      "title": "Fullstack Developer and Programming Student",
      "description": "Fullstack Developer from Argentina and Programming Student. Currently building I7A UI and integrating Artificial Intelligence into modern applications.",
      "greeting": "Hello, I'm Ignacio"
    },
    "blog": {
      "title": "Blog",
      "description": "Discover my posts about tech, programming, AI, opinions, etc."
    },
    "aboutMe": {
      "title": "About me",
      "description": "Who I am, what I do, and why I enjoy coding so much",
      "headline": "Fullstack Developer and Programming Student",
      "items": [
        {
          "content": "I'm <b>Ignacio Figueroa</b>, I study Programming at UTN and I also learn a lot on my own. I'm really interested in <b>Fullstack Development</b> and understanding how an application is built from scratch. I enjoy working with <b>modern technologies</b> and seeing what I can create with them. I also care about using <b>good architectures</b>, thinking through the <b>structure</b> of projects, and applying <b>OOP</b> to keep everything organized and scalable. For me, programming is a challenge where there's always something new to figure out."
        },
        {
          "content": "I usually build <b>personal projects</b>, from small components to full applications. Each project is an excuse to experiment and try new ideas. My strongest area is the <b>Frontend</b> because of the design and interaction, but I also enjoy working on the <b>Backend</b>, building APIs and understanding how all the pieces connect."
        },
        {
          "content": "Lately, I've been diving deeper into integrating <b>Artificial Intelligence</b> into modern applications, aiming to add smarter features and automate tasks that used to take more time. What drives me is the idea of continuously <b>improving</b> what I do, discovering new tools, and finding solutions that actually work. Every project is a way to <b>grow</b> and show what I'm learning."
        }
      ]
    },
    "projects": {
      "title": "Projects",
      "description": "The things I build out of curiosity or need",
      "featuredProjects": "featured projects",
      "otherProjects": "other projects"
    },
    "stack": {
      "title": "Stack",
      "description": "Technologies I work with and focus on the most.",
      "categories": {
        "frontend": "Frontend",
        "backend": "Backend & Infrastructure",
        "cms": "CMS & Content",
        "others": "Tools & extras",
        "ai": "AI & Copilots"
      }
    },
    "experience": {
      "title": "Experience",
      "description": "A summary of my journey as a developer"
    }
  },
  "ui": {
    "navigation": [
      {
        "label": "about me",
        "href": "/"
      },
      {
        "label": "blog",
        "href": "/blog"
      },
      {
        "label": "projects",
        "href": "/projects"
      },
      {
        "label": "experience",
        "href": "/experience"
      },
      {
        "label": "stack",
        "href": "/stack"
      }
    ]
  },
  "components": {
    "projectItem": {
      "actions": {
        "details": "Details"
      }
    },
    "footer": {
      "builtIn": "built in next.js and payloadcms",
      "text": "You can contact me below."
    },
    "error": "An error occurred while loading the data.",
    "loader": "Loading...",
    "postItem": {
      "readMore": "Read More"
    },
    "viewCvButton": {
      "label": "View Resume",
      "url": "/pdf/IgnacioFigueroa_CV_FullstackDeveloper_EN.pdf"
    }
  }
}
