{
  "sections": {
    "home": {
      "title": "Fullstack Developer and Programming Student",
      "greeting": "Hey, I'm Ignacio",
      "description": "Software developer from Argentina. Currently building I7A UI and always working on something new. If you want to chat or collaborate, reach out below."
    },
    "thoughts": {
      "title": "Thoughts",
      "description": "> a space where I write down what I learn, experiment with, and break while coding."
    },
    "me": {
      "title": "About me",
      "description": "> who I am, what I do, and why I enjoy coding so much",
      "headline": "Fullstack Developer and Programming Student",
      "items": [
        {
          "content": "I'm Ignacio Figueroa, I study programming at UTN and love learning on my own. I enjoy exploring new technologies and seeing what I can build with them. For me, programming is both a fun challenge and a way to create useful, creative things."
        },
        {
          "content": "I like working on personal projects, from small components to full apps. Each project is an excuse to try new ideas and keep learning. I’m really into frontend —building clean and nice interfaces— but I also enjoy understanding how everything works behind the scenes."
        },
        {
          "content": "I work by testing things out, making mistakes, and adjusting until it feels right. I read, watch examples, and then apply what I learn to real projects. I like documenting what I learn and sharing it in my portfolio or blog."
        },
        {
          "content": "What motivates me the most is learning, creating, and experimenting. I love solving problems, discovering new tools, and improving my craft. Every line of code is a chance to learn and grow, and I always try to make my projects reflect my curiosity and passion for programming."
        }
      ]
    },
    "projects": {
      "title": "Projects",
      "description": "> the things I build out of curiosity or need",
      "featuredProjects": "featured projects",
      "otherProjects": "other projects"
    },
    "stack": {
      "title": "Stack",
      "description": "> the technologies I use, like, and rely on to create",
      "categories": {
        "frontend": "Frontend",
        "backend": "Backend & Infrastructure",
        "cms": "CMS & Content",
        "others": "Tools & extras"
      }
    },
    "experience": {
      "title": "Experience",
      "description": "> a summary of my journey as a developer"
    }
  },
  "ui": {
    "navigation": [
      {
        "label": "blog",
        "href": "/"
      },
      {
        "label": "me",
        "href": "/me"
      },
      {
        "label": "projects",
        "href": "/projects"
      },
      {
        "label": "experience",
        "href": "/experience"
      },
      {
        "label": "stack",
        "href": "/stack"
      }
    ]
  },
  "components": {
    "projectItem": {
      "actions": {
        "details": "Details"
      }
    },
    "footer": {
      "builtIn": "built in next.js and payloadcms",
      "text": "You can contact me below."
    },
    "error": "An error occurred while loading the data.",
    "loader": "Loading...",
    "postItem": {
      "readMore": "Read More"
    }
  }
}
