{
  "sections": {
    "home": {
      "title": "Desarrollador Fullstack y estudiante de Programación",
      "description": "Desarrollador Fullstack de Argentina y estudiante de Programación. Actualmente construyendo I7A UI e integrando Inteligencia Artificial en aplicaciones modernas.",
      "greeting": "Hola, soy Ignacio"
    },
    "blog": {
      "title": "Blog",
      "description": "Descubre mis publicaciones sobre tecnología, programación, IA, opiniones, etc."
    },
    "aboutMe": {
      "title": "Sobre mí",
      "description": "Quién soy, qué hago y por qué me gusta tanto programar",
      "headline": "Desarrollador Fullstack y Estudiante de Programación",
      "items": [
        {
          "content": "Soy <b>Ignacio Figueroa</b>, estudio Programación en la UTN y también voy aprendiendo por mi cuenta. Me interesa mucho el <b>Desarrollo Fullstack</b> y entender cómo se arma una aplicación desde cero. Me gusta utilizar <b>tecnologías modernas</b> y ver qué puedo construir con ellas. Además, me interesa trabajar con <b>buenas arquitecturas</b>, pensar en la <b>estructura</b> de los proyectos y aplicar <b>POO</b> para mantener todo ordenado y fácil de escalar. Para mí, programar es un desafío donde siempre aparece algo nuevo para resolver."
        },
        {
          "content": "Suelo armar <b>proyectos propios</b>, desde componentes sueltos hasta apps completas. Cada proyecto es una excusa para experimentar y meter ideas nuevas. Mi fuerte es el <b>Frontend</b> por el diseño y la interacción, pero también disfruto trabajar el <b>Backend</b> construyendo API's y entender cómo se conectan todas las piezas."
        },
        {
          "content": "Últimamente estoy metiéndome fuerte en integrar <b>Inteligencia Artificial</b> en aplicaciones modernas, buscando sumar funciones más inteligentes y automatizar lo que antes llevaba tiempo. Lo que me mueve es la idea de seguir <b>mejorando</b> lo que hago, descubrir herramientas nuevas y encontrar soluciones que estén buenas. Cada proyecto es una manera de <b>crecer</b> y de mostrar lo que voy aprendiendo."
        }
      ]
    },
    "projects": {
      "title": "Proyectos",
      "description": "Las cosas que construyo por curiosidad o necesidad",
      "featuredProjects": "proyectos destacados",
      "otherProjects": "otros proyectos"
    },
    "stack": {
      "title": "Stack",
      "description": "Tecnologías con las que trabajo y en las que más me enfoco.",
      "categories": {
        "frontend": "Frontend",
        "backend": "Backend e Infraestructura",
        "cms": "CMS y Contenido",
        "others": "Herramientas y extras",
        "ai": "IA y Copilotos"
      }
    },
    "experience": {
      "title": "Experiencia",
      "description": "Un resumen de mi recorrido como desarrollador"
    }
  },
  "ui": {
    "navigation": [
      {
        "label": "sobre mi",
        "href": "/"
      },
      {
        "label": "blog",
        "href": "/blog"
      },
      {
        "label": "proyectos",
        "href": "/projects"
      },
      {
        "label": "experiencia",
        "href": "/experience"
      },
      {
        "label": "stack",
        "href": "/stack"
      }
    ]
  },
  "components": {
    "projectItem": {
      "actions": {
        "details": "Detalles"
      }
    },
    "footer": {
      "builtIn": "construido en next.js y payloadcms",
      "text": "Puedes contactarme aquí abajo."
    },
    "error": "Ha ocurrido un error al cargar los datos.",
    "loader": "Cargando...",
    "postItem": {
      "readMore": "Leer Más"
    },
    "viewCvButton": {
      "label": "Ver Curriculum Vitae",
      "url": "/pdf/IgnacioFigueroa_CV_FullstackDeveloper_ES.pdf"
    }
  }
}
