{
  "sections": {
    "home": {
      "title": "Desarrollador Fullstack y Estudiante de Programación",
      "greeting": "Hey, soy Ignacio",
      "description": "Desarrollador de software de Argentina. Actualmente construyendo I7A UI y siempre metido en algo nuevo. Si querés charlar o colaborar, contactame acá abajo."
    },
    "thoughts": {
      "title": "Pensamientos",
      "description": "> un espacio donde anoto lo que aprendo, experimento y rompo mientras programo."
    },
    "me": {
      "title": "Sobre mí",
      "description": "> quién soy, qué hago y por qué me gusta tanto programar",
      "headline": "Desarrollador Fullstack y Estudiante de Programación",
      "items": [
        {
          "content": "Soy Ignacio Figueroa, estudio programación en la utn y me encanta aprender por mi cuenta. Me gusta explorar nuevas tecnologías y ver qué puedo hacer con ellas. Para mí programar es un desafío copado y una forma de crear cosas útiles y creativas."
        },
        {
          "content": "Me gusta armar proyectos propios, desde componentes chicos hasta apps completas. Cada proyecto es una excusa para probar ideas nuevas y aprender. Me va mucho el frontend, hacer interfaces limpias y lindas, pero también me copa entender cómo funciona todo por atrás."
        },
        {
          "content": "Trabajo probando cosas, equivocándome y ajustando hasta que quede bien. Leo, miro ejemplos y después lo aplico en proyectos reales. Me gusta ir documentando lo que aprendo y compartirlo en mi portfolio o blog."
        },
        {
          "content": "Lo que más me motiva es aprender, crear y experimentar. Me re copa resolver problemas, descubrir herramientas nuevas y mejorar lo que hago. Cada línea de código es una oportunidad para aprender algo y crecer, y siempre busco que mis proyectos reflejen mi curiosidad y las ganas que le pongo a programar."
        }
      ]
    },
    "projects": {
      "title": "Proyectos",
      "description": "> las cosas que construyo por curiosidad o necesidad",
      "featuredProjects": "proyectos destacados",
      "otherProjects": "otros proyectos"
    },
    "stack": {
      "title": "Stack",
      "description": "> las tecnologías que uso, me gustan y me ayudan a crear",
      "categories": {
        "frontend": "Frontend",
        "backend": "Backend e Infraestructura",
        "cms": "CMS y Contenido",
        "others": "Herramientas y extras"
      }
    },
    "experience": {
      "title": "Experiencia",
      "description": "> un resumen de mi recorrido como desarrollador"
    }
  },
  "ui": {
    "navigation": [
      {
        "label": "blog",
        "href": "/"
      },
      {
        "label": "yo",
        "href": "/me"
      },
      {
        "label": "proyectos",
        "href": "/projects"
      },
      {
        "label": "experiencia",
        "href": "/experience"
      },
      {
        "label": "stack",
        "href": "/stack"
      }
    ]
  },
  "components": {
    "projectItem": {
      "actions": {
        "details": "Detalles"
      }
    },
    "footer": {
      "builtIn": "construido en next.js y payloadcms",
      "headline": "Desarrollador Fullstack y Estudiante de Programación"
    },
    "error": "Ha ocurrido un error al cargar los datos.",
    "loader": "Cargando..."
  }
}
